src/assets/jpg/core.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0"
    xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <SOAP-ENV:Header>
        <md:metadata>
            <traceNumber>2815722.5153838</traceNumber>
            <serviceId>modifyBasicIndividualDataGeneral</serviceId>
            <serviceVersion>1.2</serviceVersion>
            <sessionId>657B6E922986E42D00BE62BCCD5615DD</sessionId>
            <targetChannel>
                <mnemonic>IN</mnemonic>
            </targetChannel>
            <executingChannel>
                <mnemonic>IN</mnemonic>
            </executingChannel>
            <address>ip=201.183.86.108;</address>
            <organizationId>uriTech=EMPRESA@2616074;uriSFB=Cedula#0921972758;</organizationId>
            <executingOperatorId>uriTech=OPERADOR_EMPRESA@2616081;uriSFB=Cedula#0921972758;OWNER=true;userName=cacuria2018;</executingOperatorId>
            <terminalId>host=ET0001;</terminalId>
            <featureId>ROL@5094</featureId>
            <locale>es_CR</locale>
            <customProperties/>
        </md:metadata>
        <wsse:Security SOAP-ENV:mustUnderstand="true">
            <saml2:Assertion ID="_ID1" IssueInstant="2014-04-16T21:44:56.855Z"
        Version="2.0"
                xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="saml2:AssertionType">
                <saml2:Issuer>PacificoMultichannelProperties</saml2:Issuer>
                <saml2:Subject>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>Token</ds:KeyAlias>
                                <ds:KeyValue>A91M1FPARS0AE5SBXPBKTKQCYJ1BCUBT</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>userId</ds:KeyAlias>
                                <ds:KeyValue>USROMNI</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>password</ds:KeyAlias>
                                <ds:KeyValue>Pacifico2015</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>ip</ds:KeyAlias>
                                <ds:KeyValue>10.1.226.140</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>agencia</ds:KeyAlias>
                                <ds:KeyValue>0</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>Agencia</ds:KeyAlias>
                                <ds:KeyValue>00</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>localidad</ds:KeyAlias>
                                <ds:KeyValue>1</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucion</ds:KeyAlias>
                                <ds:KeyValue>wsksq|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucionTC</ds:KeyAlias>
                                <ds:KeyValue>TRJMOVIBDP|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucionTCINT</ds:KeyAlias>
                                <ds:KeyValue>TRJINTERMABDP|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucionEstCta</ds:KeyAlias>
                                <ds:KeyValue>sADfggdfggPADSOP545B|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>idMensaje</ds:KeyAlias>
                                <ds:KeyValue>0</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>macAddress</ds:KeyAlias>
                                <ds:KeyValue>90-B1-1C-78-10-B4</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>avatarUrl</ds:KeyAlias>
                                <ds:KeyValue>https://www.intermatico.com</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>localidad</ds:KeyAlias>
                                <ds:KeyValue>0</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>localidadDescripcion</ds:KeyAlias>
                                <ds:KeyValue>GUAYAQUIL</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>tokenSeguridad</ds:KeyAlias>
                                <ds:KeyValue>WSPruebaConsultaBP</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                </saml2:Subject>
            </saml2:Assertion>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <srv:modifyBasicIndividualDataGeneralRequest
            xmlns:srv="http://www.technisys.net/cmm/services/modifyBasicIndividualDataGeneral/rq/v0.0">
            <collection name="address">
                <address>
                    <provinceCode>
                        <officialId>9</officialId>
                    </provinceCode>
                    <country>
                        <officialId>1</officialId>
                    </country>
                    <stampUser>
                        <activeFlag>false</activeFlag>
                    </stampUser>
                    <canton>
                        <officialId>1</officialId>
                    </canton>
                    <status>
                        <officialId>1</officialId>
                    </status>
                    <id>1</id>
                    <street/>
                    <exactAddress>URBANIZACION METROPOLIS 2H MZ 1285 VILLA 17</exactAddress>
                    <isForCorrespondence>true</isForCorrespondence>
                </address>
                <address>
                    <provinceCode>
                        <officialId>17</officialId>
                    </provinceCode>
                    <country>
                        <officialId>1</officialId>
                    </country>
                    <stampUser>
                        <activeFlag>false</activeFlag>
                    </stampUser>
                    <canton>
                        <officialId>1</officialId>
                    </canton>
                    <status>
                        <officialId>2</officialId>
                    </status>
                    <id>1</id>
                    <street/>
                    <exactAddress>P ICAZA 200 Y PEDRO CARBO</exactAddress>
                    <isForCorrespondence>false</isForCorrespondence>
                </address>
                <address>
                    <provinceCode>
                        <officialId>9</officialId>
                    </provinceCode>
                    <country>
                        <officialId>1</officialId>
                    </country>
                    <stampUser>
                        <activeFlag>true</activeFlag>
                    </stampUser>
                    <canton>
                        <officialId>1</officialId>
                    </canton>
                    <status>
                        <officialId>6</officialId>
                    </status>
                    <id>1</id>
                    <stampAdditional>gancoce@gmail.com</stampAdditional>
                    <isForCorrespondence>false</isForCorrespondence>
                </address>
                <address>
                    <provinceCode>
                        <officialId>9</officialId>
                    </provinceCode>
                    <country>
                        <officialId>1</officialId>
                    </country>
                    <stampUser>
                        <activeFlag>false</activeFlag>
                    </stampUser>
                    <canton>
                        <officialId>1</officialId>
                    </canton>
                    <status>
                        <officialId>7</officialId>
                    </status>
                    <id>1</id>
                    <stampAdditional>ALLYSSONTINISTA@GMAIL.COM</stampAdditional>
                    <isForCorrespondence>false</isForCorrespondence>
                </address>
            </collection>
            <employmentSituation name="employmentSituation">
                <mnemonic>DEPENDIENTE</mnemonic>
            </employmentSituation>
            <balanceSheet name="balanceSheet">
                <debitLocalCurrency>53802.0</debitLocalCurrency>
                <creditLocalCurrency>69000.0</creditLocalCurrency>
                <balanceLocalCurrency>15198.0</balanceLocalCurrency>
                <creditForeignCurrency>0.0</creditForeignCurrency>
                <stampAdditional>ASDKNASLDNASLKDNASLDKN</stampAdditional>
            </balanceSheet>
            <position name="position">
                <officialId>139</officialId>
            </position>
            <collection name="contactPhone">
                <contactPhone>
                    <orderPhone>1</orderPhone>
                    <areaCode>5934</areaCode>
                    <phoneNumber>6036237</phoneNumber>
                    <code>0</code>
                    <name>Domicilio</name>
                </contactPhone>
                <contactPhone>
                    <orderPhone>3</orderPhone>
                    <areaCode>5939</areaCode>
                    <phoneNumber>82691893</phoneNumber>
                    <code>0</code>
                    <name>Movil</name>
                </contactPhone>
                <contactPhone>
                    <orderPhone>4</orderPhone>
                    <areaCode>5934</areaCode>
                    <phoneNumber>3731500</phoneNumber>
                    <phoneExtension>354678</phoneExtension>
                    <name>Trabajo</name>
                </contactPhone>
                <contactPhone>
                    <orderPhone>5</orderPhone>
                    <areaCode>5939</areaCode>
                    <phoneNumber>82794893</phoneNumber>
                    <code>0</code>
                    <name>Movil</name>
                </contactPhone>
            </collection>
            <basicIndividualData name="basicIndividualData">
                <customer>
                    <identificationType>
                        <mnemonic>CED</mnemonic>
                    </identificationType>
                    <businessSector>
                        <officialId>11</officialId>
                    </businessSector>
                    <institution>
                        <institutionType>
                            <originalCodes>Natural</originalCodes>
                        </institutionType>
                    </institution>
                    <electronicsContact>
                        <emailAddressComplete>JOELMANTUANO98@GMAIL.COM</emailAddressComplete>
                    </electronicsContact>
                    <pending>
                        <firstName1/>
                        <lastName1/>
                        <firstName2/>
                        <lastName2/>
                        <identificationNumber/>
                    </pending>
                    <contactCelPhone>
                        <phoneNumber>593982691893</phoneNumber>
                    </contactCelPhone>
                    <sexCode>
                        <mnemonic>Masculino</mnemonic>
                    </sexCode>
                    <maritalStatus>
                        <mnemonic>SOLTERO</mnemonic>
                    </maritalStatus>
                    <id>5109611</id>
                    <firstName1>CARLOS</firstName1>
                    <lastName1>CAGUA</lastName1>
                    <firstName2>GEOVANNY</firstName2>
                    <lastName2>CAGUA</lastName2>
                    <identificationNumber>0921972758</identificationNumber>
                    <incomeAmount>24384.2</incomeAmount>
                    <egressAmount>2400.0</egressAmount>
                </customer>
                <stampUser>
                    <electronicsContact>
                        <emailAddressComplete>YOZU98@GMAIL.COM</emailAddressComplete>
                    </electronicsContact>
                    <contactCelPhone>
                        <phoneNumber>593982691893</phoneNumber>
                    </contactCelPhone>
                </stampUser>
                <institutionProfession>
                    <longDesc>CAMARONERA</longDesc>
                    <officialId>18</officialId>
                </institutionProfession>
                <profession>
                    <officialId>77</officialId>
                </profession>
                <nationality>
                    <mnemonic>ECUATORIANA</mnemonic>
                </nationality>
                <educationLevel>
                    <mnemonic>POSTGRADO</mnemonic>
                </educationLevel>
                <birthDate>19821217220000000-0500</birthDate>
            </basicIndividualData>
        </srv:modifyBasicIndividualDataGeneralRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
